#Дан словарь на 6 персон, найти и вывести наибольшее и наименьшее значение роста (в см.).
#(Пример, {“Андрей”: 178, “Виктор”: 150, “Максим”: 200, ...}, наибольшее 200, наименьшее 150).

people = {"Андрей": 178, "Виктор": 150, "Максим": 200, "Елена": 165, "Ольга": 173, "Иван": 182} # создаем словарь

max_height = max(people.values()) # находим наибольшее значение роста

min_height = min(people.values()) # находим наименьшее значение роста

# выводим результаты
print("Наибольший рост:", max_height, "см")
print("Наименьший рост:", min_height, "см")